Autodesk.Revit.DB.IViewSheetSet.Views
The views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the set operation failed due to invalid view which cannot be printed.

Autodesk.Revit.DB.IViewSheetSet
This interface represents a selected set of views/sheets which will be used for printing.